Hi @LaurentLesle , I tries to provsion with the provided configuration, but I can provision without error. Could please help provide [logs ](https://developer.hashicorp.com/terraform/internals/debugging)with API request details by running `TF_LOG=DEBUG TF_LOG_PATH=~/tf.log terrafrom apply`?

<details>

```hcl
-> % terraform apply -auto-approve

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the
following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_application_insights.example[0] will be created
  + resource "azurerm_application_insights" "example" {
      + app_id                                = (known after apply)
      + application_type                      = "web"
      + connection_string                     = (sensitive value)
      + daily_data_cap_in_gb                  = (known after apply)
      + daily_data_cap_notifications_disabled = (known after apply)
      + disable_ip_masking                    = false
      + force_customer_storage_for_profiler   = false
      + id                                    = (known after apply)
      + instrumentation_key                   = (sensitive value)
      + internet_ingestion_enabled            = true
      + internet_query_enabled                = true
      + local_authentication_disabled         = false
      + location                              = "westeurope"
      + name                                  = "example-appinsights-0"
      + resource_group_name                   = "wt-exrg"
      + retention_in_days                     = 90
      + sampling_percentage                   = 100
    }

  # azurerm_application_insights.example[1] will be created
  + resource "azurerm_application_insights" "example" {
      + app_id                                = (known after apply)
      + application_type                      = "web"
      + connection_string                     = (sensitive value)
      + daily_data_cap_in_gb                  = (known after apply)
      + daily_data_cap_notifications_disabled = (known after apply)
      + disable_ip_masking                    = false
      + force_customer_storage_for_profiler   = false
      + id                                    = (known after apply)
      + instrumentation_key                   = (sensitive value)
      + internet_ingestion_enabled            = true
      + internet_query_enabled                = true
      + local_authentication_disabled         = false
      + location                              = "westeurope"
      + name                                  = "example-appinsights-1"
      + resource_group_name                   = "wt-exrg"
      + retention_in_days                     = 90
      + sampling_percentage                   = 100
    }

  # azurerm_application_insights.example[2] will be created
  + resource "azurerm_application_insights" "example" {
      + app_id                                = (known after apply)
      + application_type                      = "web"
      + connection_string                     = (sensitive value)
      + daily_data_cap_in_gb                  = (known after apply)
      + daily_data_cap_notifications_disabled = (known after apply)
      + disable_ip_masking                    = false
      + force_customer_storage_for_profiler   = false
      + id                                    = (known after apply)
      + instrumentation_key                   = (sensitive value)
      + internet_ingestion_enabled            = true
      + internet_query_enabled                = true
      + local_authentication_disabled         = false
      + location                              = "westeurope"
      + name                                  = "example-appinsights-2"
      + resource_group_name                   = "wt-exrg"
      + retention_in_days                     = 90
      + sampling_percentage                   = 100
    }

  # azurerm_application_insights.example[3] will be created
  + resource "azurerm_application_insights" "example" {
      + app_id                                = (known after apply)
      + application_type                      = "web"
      + connection_string                     = (sensitive value)
      + daily_data_cap_in_gb                  = (known after apply)
      + daily_data_cap_notifications_disabled = (known after apply)
      + disable_ip_masking                    = false
      + force_customer_storage_for_profiler   = false
      + id                                    = (known after apply)
      + instrumentation_key                   = (sensitive value)
      + internet_ingestion_enabled            = true
      + internet_query_enabled                = true
      + local_authentication_disabled         = false
      + location                              = "westeurope"
      + name                                  = "example-appinsights-3"
      + resource_group_name                   = "wt-exrg"
      + retention_in_days                     = 90
      + sampling_percentage                   = 100
    }

  # azurerm_application_insights.example[4] will be created
  + resource "azurerm_application_insights" "example" {
      + app_id                                = (known after apply)
      + application_type                      = "web"
      + connection_string                     = (sensitive value)
      + daily_data_cap_in_gb                  = (known after apply)
      + daily_data_cap_notifications_disabled = (known after apply)
      + disable_ip_masking                    = false
      + force_customer_storage_for_profiler   = false
      + id                                    = (known after apply)
      + instrumentation_key                   = (sensitive value)
      + internet_ingestion_enabled            = true
      + internet_query_enabled                = true
      + local_authentication_disabled         = false
      + location                              = "westeurope"
      + name                                  = "example-appinsights-4"
      + resource_group_name                   = "wt-exrg"
      + retention_in_days                     = 90
      + sampling_percentage                   = 100
    }

  # azurerm_monitor_private_link_scope.example will be created
  + resource "azurerm_monitor_private_link_scope" "example" {
      + id                  = (known after apply)
      + name                = "example-ampls"
      + resource_group_name = "wt-exrg"
    }

  # azurerm_monitor_private_link_scoped_service.example[0] will be created
  + resource "azurerm_monitor_private_link_scoped_service" "example" {
      + id                  = (known after apply)
      + linked_resource_id  = (known after apply)
      + name                = "example-amplsservice-0"
      + resource_group_name = "wt-exrg"
      + scope_name          = "example-ampls"
    }

  # azurerm_monitor_private_link_scoped_service.example[1] will be created
  + resource "azurerm_monitor_private_link_scoped_service" "example" {
      + id                  = (known after apply)
      + linked_resource_id  = (known after apply)
      + name                = "example-amplsservice-1"
      + resource_group_name = "wt-exrg"
      + scope_name          = "example-ampls"
    }

  # azurerm_monitor_private_link_scoped_service.example[2] will be created
  + resource "azurerm_monitor_private_link_scoped_service" "example" {
      + id                  = (known after apply)
      + linked_resource_id  = (known after apply)
      + name                = "example-amplsservice-2"
      + resource_group_name = "wt-exrg"
      + scope_name          = "example-ampls"
    }

  # azurerm_monitor_private_link_scoped_service.example[3] will be created
  + resource "azurerm_monitor_private_link_scoped_service" "example" {
      + id                  = (known after apply)
      + linked_resource_id  = (known after apply)
      + name                = "example-amplsservice-3"
      + resource_group_name = "wt-exrg"
      + scope_name          = "example-ampls"
    }

  # azurerm_monitor_private_link_scoped_service.example[4] will be created
  + resource "azurerm_monitor_private_link_scoped_service" "example" {
      + id                  = (known after apply)
      + linked_resource_id  = (known after apply)
      + name                = "example-amplsservice-4"
      + resource_group_name = "wt-exrg"
      + scope_name          = "example-ampls"
    }

  # azurerm_resource_group.example will be created
  + resource "azurerm_resource_group" "example" {
      + id       = (known after apply)
      + location = "westeurope"
      + name     = "wt-exrg"
    }

Plan: 12 to add, 0 to change, 0 to destroy.
azurerm_resource_group.example: Creating...
azurerm_resource_group.example: Creation complete after 3s [id=/subscriptions/xxx/resourceGroups/wt-exrg]
azurerm_application_insights.example[0]: Creating...
azurerm_application_insights.example[1]: Creating...
azurerm_monitor_private_link_scope.example: Creating...
azurerm_application_insights.example[2]: Creating...
azurerm_application_insights.example[3]: Creating...
azurerm_application_insights.example[4]: Creating...
azurerm_monitor_private_link_scope.example: Creation complete after 8s [id=/subscriptions/xxx/resourceGroups/wt-exrg/providers/Microsoft.Insights/privateLinkScopes/example-ampls]
azurerm_application_insights.example[0]: Still creating... [10s elapsed]
azurerm_application_insights.example[1]: Still creating... [10s elapsed]
azurerm_application_insights.example[2]: Still creating... [10s elapsed]
azurerm_application_insights.example[4]: Still creating... [10s elapsed]
azurerm_application_insights.example[3]: Still creating... [10s elapsed]
azurerm_application_insights.example[1]: Creation complete after 17s [id=/subscriptions/xxx/resourceGroups/wt-exrg/providers/Microsoft.Insights/components/example-appinsights-1]
azurerm_application_insights.example[2]: Creation complete after 17s [id=/subscriptions/xxx/resourceGroups/wt-exrg/providers/Microsoft.Insights/components/example-appinsights-2]
azurerm_application_insights.example[0]: Creation complete after 17s [id=/subscriptions/xxx/resourceGroups/wt-exrg/providers/Microsoft.Insights/components/example-appinsights-0]
azurerm_application_insights.example[3]: Creation complete after 17s [id=/subscriptions/xxx/resourceGroups/wt-exrg/providers/Microsoft.Insights/components/example-appinsights-3]
azurerm_application_insights.example[4]: Creation complete after 18s [id=/subscriptions/xxx/resourceGroups/wt-exrg/providers/Microsoft.Insights/components/example-appinsights-4]
azurerm_monitor_private_link_scoped_service.example[4]: Creating...
azurerm_monitor_private_link_scoped_service.example[0]: Creating...
azurerm_monitor_private_link_scoped_service.example[2]: Creating...
azurerm_monitor_private_link_scoped_service.example[3]: Creating...
azurerm_monitor_private_link_scoped_service.example[1]: Creating...
azurerm_monitor_private_link_scoped_service.example[2]: Creation complete after 6s [id=/subscriptions/xxx/resourceGroups/wt-exrg/providers/Microsoft.Insights/privateLinkScopes/example-ampls/scopedResources/example-amplsservice-2]
azurerm_monitor_private_link_scoped_service.example[0]: Still creating... [10s elapsed]
azurerm_monitor_private_link_scoped_service.example[4]: Still creating... [10s elapsed]
azurerm_monitor_private_link_scoped_service.example[3]: Still creating... [10s elapsed]
azurerm_monitor_private_link_scoped_service.example[1]: Still creating... [10s elapsed]
azurerm_monitor_private_link_scoped_service.example[4]: Still creating... [20s elapsed]
azurerm_monitor_private_link_scoped_service.example[3]: Still creating... [20s elapsed]
azurerm_monitor_private_link_scoped_service.example[0]: Still creating... [20s elapsed]
azurerm_monitor_private_link_scoped_service.example[1]: Still creating... [20s elapsed]
azurerm_monitor_private_link_scoped_service.example[3]: Still creating... [30s elapsed]
azurerm_monitor_private_link_scoped_service.example[0]: Still creating... [30s elapsed]
azurerm_monitor_private_link_scoped_service.example[4]: Still creating... [30s elapsed]
azurerm_monitor_private_link_scoped_service.example[1]: Still creating... [30s elapsed]
azurerm_monitor_private_link_scoped_service.example[0]: Creation complete after 36s [id=/subscriptions/xxx/resourceGroups/wt-exrg/providers/Microsoft.Insights/privateLinkScopes/example-ampls/scopedResources/example-amplsservice-0]
azurerm_monitor_private_link_scoped_service.example[1]: Creation complete after 38s [id=/subscriptions/xxx/resourceGroups/wt-exrg/providers/Microsoft.Insights/privateLinkScopes/example-ampls/scopedResources/example-amplsservice-1]
azurerm_monitor_private_link_scoped_service.example[3]: Still creating... [40s elapsed]
azurerm_monitor_private_link_scoped_service.example[4]: Still creating... [40s elapsed]
azurerm_monitor_private_link_scoped_service.example[3]: Creation complete after 40s [id=/subscriptions/xxx/resourceGroups/wt-exrg/providers/Microsoft.Insights/privateLinkScopes/example-ampls/scopedResources/example-amplsservice-3]
azurerm_monitor_private_link_scoped_service.example[4]: Creation complete after 41s [id=/subscriptions/xxx/resourceGroups/wt-exrg/providers/Microsoft.Insights/privateLinkScopes/example-ampls/scopedResources/example-amplsservice-4]

Apply complete! Resources: 12 added, 0 changed, 0 destroyed.
```

</details>